app/controllers/projects_controller.rb

  def index
    projects = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    project = Project.create!(project_params)
---
INSERT INTO "projects" ("title", "user_id") VALUES ($1, $2) RETURNING "id"  [["title", "TEST Project"], ["user_id", 21]]

  def show
    project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]