app/controllers/steps_controller.rb

  def index
    steps = Step.all
---
SELECT "steps".* FROM "steps"

  def create
    step = Step.create(step_params)
---
INSERT INTO "steps" ("project_id", "order", "heading", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["project_id", 60], ["order", 1], ["heading", "get it"], ["content", "This should work"], ["created_at", "2020-06-10 01:53:03.946896"], ["updated_at", "2020-06-10 01:53:03.946896"]]

  def proj_steps
    # byebug
    steps = Step.where(project_id: params[:id])
---
SELECT "steps".* FROM "steps" WHERE "steps"."project_id" = $1 LIMIT $2  [["project_id", nil], ["LIMIT", 1]]